УправлениеПаркомАттракционов/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>НормализованныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/Catalogs/Клиенты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПеренестиТелефонВКонтактуюИнформацию(ПараметрыОбработки) Экспорт
	
	ПараметрыОбработки.ОбработкаЗавершена = Ложь;
	
	ВидКИТелефонКлиента = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ТелефонКлиента");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 50
	|	Клиенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты.КонтактнаяИнформация КАК КлиентыКонтактнаяИнформация
	|		ПО КлиентыКонтактнаяИнформация.Ссылка = Клиенты.Ссылка
	|		И КлиентыКонтактнаяИнформация.Вид = &ВидКИТелефонКлиента
	|ГДЕ
	|	Клиенты.НормализованныйТелефон <> """"
	|	И КлиентыКонтактнаяИнформация.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидКИТелефонКлиента", ВидКИТелефонКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбработки.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		КонтактанаяИнформация = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
		ДанныеКИ = КонтактанаяИнформация.Добавить();
		ДанныеКИ.Вид = ВидКИТелефонКлиента;
		ДанныеКИ.Представление = "+" + СпрОбъект.НормализованныйТелефон;
		ДанныеКИ.Объект = СпрОбъект;
		
		УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(СпрОбъект, КонтактанаяИнформация, Ложь);
		//ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);
		СпрОбъект.Записать();
			
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
